 #Домашнее задание №2

'''
Задание №1 
Дан список. Получите новый список, в котором каждое значение
будет удвоено:
[1, 2, 3] --> [2, 4, 6]
'''
# #Решение
# l = [1, 2, 3]
# t = []
# for i in l:
#     t.append(i * 2)
# print(t)

'''
Задание №2
Дан список. Возведите в квадрат каждый из его элементов и получите
сумму всех полученных квадратов:
[1, 2, 3] --> 14 --> 1^2 + 2^2 + 3^2 = 14
'''
#
# l = [1, 2, 3]
# t = []
# for i in l:
#     t.append(i ** 2)
# print(t[0] + t[1] + t[2])

'''
Задание №3
Игорь любит кататься на велосипеде. Он знает, что при этом важно
не допустить обезвоживания и пьет по 0,5 литров воды в час. Вам 
дается время в часах, и вам нужно вернуть колличество литров, которые
Игорь выпьет с округлением до наименьшего значения.
time1 = 3 --> litres = 1
time2 = 6,7 --> litres = 3
time3 = 11.8 --> litres = 5
'''

# time = 3
# litres = 0.5
# a = litres * time
# print(int(a))
#
# time = 6.7
# litres = 0.5
# a = litres * time
# print(int(a))
#
# time = 11.8
# litres = 0.5
# a = litres * time
# print(int(a))

'''
Задание №4
Дана строчка 'Hello world'. Проверьте, если  в этой строке есть
символ пробела - " ", тогда преобразуйте строку к верхнему регистру,
если же нет, то к нижнему.
'''

# s = 'Hello world'
# if ' ' in s:
#     print(s.upper())
# else:
#     print(s.lower())

